Part2_Model/ch05_dynamic.md
```mermaid
stateDiagram-v2
    [*] --> 規劃中 : 建立課程

    規劃中 --> 開放選課 : 發佈課程大綱
    
    開放選課 --> 開放選課 : 學生申請加入/[尚未滿額]
    開放選課 --> 授課中 : 開學/停止選課
    
    授課中 --> 評分中 : 期末/開放輸入成績
    
    評分中 --> 評分中 : 老師評分/登錄成績
    評分中 --> 結業 : 計算總分/[成績皆已確認]
    
    結業 --> [*] : 歸檔
```
